app/Controllers/AuthController.php

    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $model = new UserModel();

        $user = $model->where('email', $email)->first();

        if ($user && password_verify($password, $user['password'])) {

            $model->update($user['id_user'], ['islogin' => 1]);
---
SELECT *
FROM `users`
WHERE `email` = 'admin@mail.com'
 LIMIT 1
UPDATE `users` SET `islogin` = 1, `updated_at` = '2023-09-01 16:51:37'
WHERE `users`.`id_user` IN ('2')

    public function logout()
    {
        $userID = session('userID');

        if ($userID) {
            $model = new UserModel();
            $whereCondition = ['id_user' => $userID];
            $model->set('islogin', 0)->where($whereCondition)->update();
---
UPDATE `users` SET `islogin` = 0, `updated_at` = '2023-09-01 16:52:36'
WHERE `id_user` = '2'