app/Controllers/DashboardController.php

    public function index()
    {
        $title  = 'Dashboard';

        $user = new UserModel();
        $countuser = $user->countAllResults();

        $employee = new EmployeeModel();
        $countemployee = $employee->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `employees`