app/Controllers/EmployeeController.php

    public function index()
    {
        $model = new EmployeeModel();
        $employee = $model->findAll();
---
SELECT *
FROM `employees`