app/Controllers/SettingController.php

SELECT *
FROM `users`
WHERE `id_user` = '2'
 LIMIT 1
---
    public function edit($id_user)
    {
        $model = new UserModel();
        $user = $model->where('id_user', $id_user)->first();

UPDATE `users` SET `password` = '$2y$10$yRCauMzYiEVURNOFMjpbx.ErH7kt65hwVQjclFGsKKncdx3O0BZQS', `updated_at` = '2023-09-01 16:51:22'
WHERE `users`.`id_user` IN ('2')
---
    public function security($userId)
    {

        $validation = \Config\Services::validation();
        $validation->setRules([
            'oldpassword' => 'required|min_length[6]',
            'password' => 'required|min_length[6]|differs[oldpassword]',
            'password_confirmation' => 'required|min_length[6]|matches[password]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $model = new UserModel();

        $user = $model->find($userId);

        if (!$user) {
            session()->setFlashdata('error', 'User not found !');
            return redirect()->to('/setting/' . $userId . '/edit?tab=custom-content-below-profile');
        }

        if (!password_verify($this->request->getVar('oldpassword'), $user['password'])) {
            session()->setFlashdata('error', 'Current password is incorrect.');
            return redirect()->to('/setting/' . $userId . '/edit?tab=custom-content-below-profile');
        }

        // If the old password is correct, proceed to update the password
        $newPassword = password_hash($this->request->getVar('password'), PASSWORD_DEFAULT);
        $model->update($userId, ['password' => $newPassword]);