app/Controllers/UserController.php

    public function index()
    {
        $model = new UserModel();
        $user = $model->findAll();
---
SELECT *
FROM `users`

        }

        $model = new UserModel();
        $model->insert($data);
---
INSERT INTO `users` (`name`, `email`, `password`, `level`, `image`, `created_at`, `updated_at`) VALUES ('Test', 'test@mail.com', '$2y$10$MR34S5wtiEM3mfWCzyhmrOvF6O8EnCtbWDFuvaEsAwoYcrt.oJaRK', '1', '1.jpg', '2023-09-01 17:11:57', '2023-09-01 17:11:57')

    public function edit($id_user)
    {
        $model = new UserModel();
        $user = $model->where('id_user', $id_user)->first();
---
SELECT *
FROM `users`
WHERE `id_user` = '3'
 LIMIT 1


        $model = new userModel();

        $model->update($id_user, $data);
---
UPDATE `users` SET `name` = 'Test', `email` = 'test@mail.com', `level` = '1', `updated_at` = '2023-09-01 17:12:41'
WHERE `users`.`id_user` IN ('3')

    public function delete($id_user)
    {
        $model = new userModel();

        $deleteduser = $model->where('id_user', $id_user)->first();
---
SELECT *
FROM `users`
WHERE `users`.`id_user` = '3'